[
  {
    "id": 1,
    "title": "Portfolio",
    "description": "Mon portfolio développé avec React et Framer Motion.",
    "details": "Ce portfolio est un projet personnel visant à regrouper mes réalisations, compétences et passions. Il inclut un thème jour/nuit, des animations douces avec Framer Motion, une navigation fluide et une section passion cachée en mode nuit.",
    "technos": ["React", "Sass", "Framer Motion"],
    "github": "https://github.com/DaNyrisCode/Portfolio",
    "live": "",
    "image": "./src/assets/projets/Portfolio.avif"
  },
  {
    "id": 2,
    "title": "Oh My Food",
    "description": "Un projet de réservation de menus de restaurant en mobile-first.",
    "details": "Projet orienté mobile-first avec animations CSS, structure HTML sémantique, mise en valeur des menus avec effets visuels et responsive design. Le but était de rendre l’expérience fluide et immersive pour l’utilisateur.",
    "technos": ["HTML", "Sass"],
    "github": "https://github.com/DaNyrisCode/OCRProject-OhMyFood",
    "live": "https://danyriscode.github.io/OCRProject-OhMyFood/",
    "image": "./src/assets/projets/OMF.avif"
  },
  {
    "id": 3,
    "title": "Kasa",
    "description": "Une plateforme de location d’appartements développée avec React.",
    "details": "Projet complet en React : création de composants dynamiques, gestion des routes avec React Router, affichage conditionnel et respect des maquettes Figma. Utilisation des props, des hooks et des states.",
    "technos": ["React", "Sass"],
    "github": "https://github.com/DaNyrisCode/OCR-Project-Kasa",
    "live": "",
    "image": "./src/assets/projets/Kasa.avif"
  },
  {
    "id": 4,
    "title": "Sophie Bluel",
    "description": "Un portfolio pour une architecte avec connexion a une API.",
    "details": "Réalisation d’un site avec appel à une API REST pour afficher une galerie. Connexion utilisateur, gestion du token JWT, création/suppression de projets, drag-and-drop pour uploader des images. Travail centré sur la manipulation du DOM et les requêtes asynchrones.",
    "technos": ["HTML", "Sass", "JavaScript", "API"],
    "github": "https://github.com/DaNyrisCode/OCR-Project-SophieBluel",
    "live": "",
    "image": "./src/assets/projets/Sophie.avif"
  },
  {
    "id": 5,
    "title": "724 Events",
    "description": "Debugger le site d'une agence de voyages.",
    "details": "Analyse et correction de bugs JavaScript, amélioration de la lisibilité du code, mise en place de tests unitaires avec Jasmine en suivant les principes du TDD et BDD. L'objectif était de stabiliser une base existante.",
    "technos": ["JavaScript"],
    "github": "https://github.com/DaNyrisCode/OCR-Project-724",
    "live": "",
    "image": "./src/assets/projets/724.avif"
  },
  {
    "id": 6,
    "title": "Nina Carducci",
    "description": "Optimiser le référencement d'un site de photographe.",
    "details": "Refonte SEO d’un site vitrine. Optimisation des balises HTML, amélioration du temps de chargement, compression d’images, ajout de données structurées et travail sur l’accessibilité. Objectif : meilleure visibilité sur Google.",
    "technos": ["HTML", "CSS", "JavaScript"],
    "github": "https://github.com/DaNyrisCode/OCR-Project-NinaCarducci-SEO",
    "live": "https://danyriscode.github.io/OCR-Project-NinaCarducci-SEO/",
    "image": "./src/assets/projets/Nina.avif"
  },
  {
    "id": 7,
    "title": "Argent Bank",
    "description": "Intégrer le front-end avec le back-end via des appels API pour une application bancaire.",
    "details": "Création d’une application bancaire en React avec gestion de l’authentification via Redux. Utilisation d’un backend Node.js existant. Affichage de données dynamiques, sécurisation avec token, modification de profil utilisateur.",
    "technos": ["React", "Redux", "API"],
    "github": "https://github.com/DaNyrisCode/OCR-Project-ArgentBank",
    "live": "",
    "image": "./src/assets/projets/ArgentBank.avif"
  },
  {
    "id": 8,
    "title": "Print It",
    "description": "Dynamiser le site Internet statique d’une petite imprimerie familiale.",
    "details": "Ajout de fonctionnalités dynamiques (filtrage des produits, panier, animation) avec JavaScript pur. Optimisation des performances, gestion des événements utilisateur et intégration responsive des éléments.",
    "technos": ["HTML", "CSS", "JavaScript"],
    "github": "https://github.com/DaNyrisCode/OCR-Project-Print-It",
    "live": "https://danyriscode.github.io/OCR-Project-Print-It/",
    "image": "./src/assets/projets/PrintIt.avif"
  }
]
